In [1]:
import pandas as pd

In [2]:
df = pd.read_excel('Dummy.xlsx',sheet_name='Dummy')

In [3]:
df

     a    b
0   13    4
1   22   23
2   33    5
3   47   47
4   90   91
5   81  100
6   60   77
7   40    2
8   56    5
9   31    3
10   5   10

In [4]:
import mysql.connector

mydb = mysql.connector.connect(
  host="localhost",
  user="root",
  password="12345",
  database="dummy_database"
)

In [5]:
from sqlalchemy import create_engine

In [6]:
# Step 2: Create a SQLAlchemy engine to connect to the MySQL database
engine = create_engine("mysql+mysqlconnector://root:12345@localhost/dummy_database")

In [7]:
# Step 3: Convert the Pandas DataFrame to a format for MySQL table insertion
df.to_sql('dummy', con=engine, if_exists='append', index=False)

11